In [5]:
text_file_path = r'data/accounts.txt'
temp_file_path = r'data/temp_file.txt'

In [2]:
"""ファイルの書き込み"""
with open(text_file_path, mode='w') as accounts:
    accounts.write('100 Jones 24.98\n')
    accounts.write('200 Doe 345.65\n')
    accounts.write('300 White 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')
    # print('100 Jones 24.98', file=accounts)

In [ ]:
#ファイルの各行を読み込んで処理する場合、readlineメソッドを使うより、for文で使う方が順次処理できる

In [3]:
"""ファイルの読み込み"""
with open(text_file_path, mode='r') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.65
300       White           0.00
400       Stone         -42.16
500       Rich          224.62

In [6]:
"""ファイルの更新"""
accounts = open(text_file_path, 'r')
temp_file = open(temp_file_path, 'w')

with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != '300':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

In [7]:
import os

In [8]:
os.remove(text_file_path)
os.rename(temp_file_path, text_file_path)

In [9]:
"""オブジェクトJSONへのシリアライジング"""
import json

In [10]:
accounts_dict = {'accounts': [
    {'account': 100, 'name': 'Jones', 'balance': 24.98},
    {'account': 100, 'name': 'Jones', 'balance': 24.98}
]}

In [12]:
accounts_json_path = 'data/accounts.json'

In [13]:
"""jsonファイルへの書き込み"""
with open(accounts_json_path, 'w') as accounts:
    json.dump(accounts_dict, accounts)

In [14]:
"""jsonファイルの読み込み"""
with open(accounts_json_path, 'r') as accounts:
    accounts_json = json.load(accounts)
accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 100, 'name': 'Jones', 'balance': 24.98}]}

In [15]:
accounts_json['accounts']

[{'account': 100, 'name': 'Jones', 'balance': 24.98},
 {'account': 100, 'name': 'Jones', 'balance': 24.98}]

In [16]:
accounts_json['accounts'][0]

{'account': 100, 'name': 'Jones', 'balance': 24.98}

In [18]:
"""JSONテキストの表示"""
with open(accounts_json_path, 'r') as accounts:
    print(json.dumps(json.load(accounts), indent=4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        }
    ]
}

In [19]:
"""csvファイルの操作"""
import csv

In [20]:
csv_file_path = r'data/accounts.csv'

In [21]:
"""csvファイルへの書き込み"""
with open(csv_file_path, mode='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.98])
    writer.writerow([200, 'Aones', 24.91])
    writer.writerow([300, 'Bones', 24.92])
    writer.writerow([400, 'Cones', 24.93])
    writer.writerow([500, 'Dones', 24.94])

In [22]:
"""csvファイルの読み込み"""
with open(csv_file_path, 'r', newline='') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Aones          24.91
300       Bones          24.92
400       Cones          24.93
500       Dones          24.94

In [23]:
"""csvファイルのpandasのDataFrameへの読み込み"""
import pandas as pd

In [26]:
df = pd.read_csv(csv_file_path, names=['account', 'name', 'balance'])
# namesがない場合は先頭行を列名だと認識する
df2 = pd.read_csv(csv_file_path)
df2

   100  Jones  24.98
0  200  Aones  24.91
1  300  Bones  24.92
2  400  Cones  24.93
3  500  Dones  24.94

In [25]:
df

   account   name  balance
0      100  Jones    24.98
1      200  Aones    24.91
2      300  Bones    24.92
3      400  Cones    24.93
4      500  Dones    24.94

In [27]:
"""タイタニックデータセットの読み込み"""
titanic = pd.read_csv('https://vincentarelbundock.github.io/' +
                     'Rdatasets/csv/carData/TitanicSurvival.csv')

In [28]:
pd.set_option('precision', 2) #浮動小数点数のフォーマット

In [29]:
"""データの概要を見る"""
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [30]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [31]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [32]:
titanic.describe() #欠損データは無視。数値データのみ

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [33]:
"""真理値の統計"""
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object